In [8]:
import pandas as pd

In [20]:
dataset={
    'Tid':[i for i in range(1,11,1)],
    'Refund': ['Yes', 'No', 'No', 'Yes', 'No', 'No', 'Yes','No', 'No', 'No'],
    'Marital Status':['Single', 'Married','Single','Married', 'Divorced', 
                      'Married','Divorced','Single','Married', 'Single' ],
    'Taxable income': [125, 100, 70, 120, 95, 60, 220, 85, 75, 90 ],
    'Cheat': ['No','No','No','No','Yes','No','No','Yes','No','Yes']
}

In [21]:
df=pd.DataFrame(dataset)

In [22]:
print(df.loc[0])

Tid                    1
Refund               Yes
Marital Status    Single
Taxable income       125
Cheat                 No
Name: 0, dtype: object

In [23]:
print(df.loc[4])

Tid                      5
Refund                  No
Marital Status    Divorced
Taxable income          95
Cheat                  Yes
Name: 4, dtype: object

In [24]:
print(df.loc[7])

Tid                    8
Refund                No
Marital Status    Single
Taxable income        85
Cheat                Yes
Name: 7, dtype: object

In [25]:
print(df.loc[8])

Tid                     9
Refund                 No
Marital Status    Married
Taxable income         75
Cheat                  No
Name: 8, dtype: object

In [26]:
from pandas.api.types import CategoricalDtype

In [27]:
departments = pd.Series(["HR", "Finance", "IT", "Marketing"], dtype="category")

In [28]:
gender = pd.Series([1, 0, 1, 1]) 
pass_fail = pd.Series(["Pass", "Fail", "Pass", "Pass"], dtype="category")

In [29]:
priority_type = CategoricalDtype(categories=["Low", "Medium", "High"], ordered=True)
priority = pd.Series(["Low", "High", "Medium", "Low"], dtype=priority_type)

In [30]:
num_of_projects = pd.Series([3, 5, 2, 4], dtype="int")

In [31]:
salary = pd.Series([45000.50, 54000.00, 61000.75, 72000.10], dtype="float")

In [32]:
df = pd.DataFrame({
    "Department (Nominal)": departments,
    "Gender (Binary)": gender,
    "Pass/Fail (Binary)": pass_fail,
    "Priority (Ordinal)": priority,
    "Projects (Discrete Numeric)": num_of_projects,
    "Salary (Continuous Numeric)": salary
})

In [33]:
print(df)
print("\nData Types:\n", df.dtypes)

  Department (Nominal)  Gender (Binary) Pass/Fail (Binary) Priority (Ordinal)  \
0                   HR                1               Pass                Low
1              Finance                0               Fail               High
2                   IT                1               Pass             Medium
3            Marketing                1               Pass                Low

   Projects (Discrete Numeric)  Salary (Continuous Numeric)
0                            3                     45000.50
1                            5                     54000.00
2                            2                     61000.75
3                            4                     72000.10

Data Types:
 Department (Nominal)           category
Gender (Binary)                   int64
Pass/Fail (Binary)             category
Priority (Ordinal)             category
Projects (Discrete Numeric)       int64
Salary (Continuous Numeric)     float64
dtype: object

In [37]:
print(df.loc[3:8])

  Department (Nominal)  Gender (Binary) Pass/Fail (Binary) Priority (Ordinal)  \
3            Marketing                1               Pass                Low

   Projects (Discrete Numeric)  Salary (Continuous Numeric)
3                            4                      72000.1

In [44]:
print(df.iloc[4:9,2:5])

Empty DataFrame
Columns: [Pass/Fail (Binary), Priority (Ordinal), Projects (Discrete Numeric)]
Index: []

In [45]:
print(df.iloc[1:,1:4])

   Gender (Binary) Pass/Fail (Binary) Priority (Ordinal)
1                0               Fail               High
2                1               Pass             Medium
3                1               Pass                Low

In [47]:
data=pd.read_csv('archive (1)/Iris.csv')

In [48]:
daf=pd.DataFrame(data)

In [49]:
print(daf.head())

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [50]:
daf.drop(4,axis=0)

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,3.0,1.4,0.2,Iris-setosa
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,4.6,3.1,1.5,0.2,Iris-setosa
5,6,5.4,3.9,1.7,0.4,Iris-setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [53]:
daf.drop('SepalWidthCm', axis=1)

      Id  SepalLengthCm  PetalLengthCm  PetalWidthCm         Species
0      1            5.1            1.4           0.2     Iris-setosa
1      2            4.9            1.4           0.2     Iris-setosa
2      3            4.7            1.3           0.2     Iris-setosa
3      4            4.6            1.5           0.2     Iris-setosa
4      5            5.0            1.4           0.2     Iris-setosa
..   ...            ...            ...           ...             ...
145  146            6.7            5.2           2.3  Iris-virginica
146  147            6.3            5.0           1.9  Iris-virginica
147  148            6.5            5.2           2.0  Iris-virginica
148  149            6.2            5.4           2.3  Iris-virginica
149  150            5.9            5.1           1.8  Iris-virginica

[150 rows x 5 columns]

In [3]:
import pandas as pd
data = {
    'Employee_ID': [101, 102, 103, 104, 105],
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Edward'],
    'Department': ['HR', 'IT', 'IT', 'Marketing', 'Sales'],
    'Age': [29, 34, 41, 28, 38],
    'Salary': [50000, 70000, 65000, 55000, 60000],
    'Years_of_Experience': [4, 8, 10, 3, 12],
    'Joining_Date': ['2020-03-15', '2017-07-19', '2013-06-01', '2021-02-10', '2010-11-25'],
    'Gender': ['Female', 'Male', 'Male', 'Female', 'Male'],
    'Bonus': [5000, 7000, 6000, 4500, 5000],
    'Rating': [4.5, 4.0, 3.8, 4.7, 3.5]
}

In [5]:
df = pd.DataFrame(data)

# a) Shape of DataFrame
print("Shape:", df.shape)

Shape: (5, 10)

In [6]:
# b) Summary: Data types and non-null counts
print("\nDataFrame Info:")
print(df.info())

DataFrame Info:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 10 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Employee_ID          5 non-null      int64
 1   Name                 5 non-null      object
 2   Department           5 non-null      object
 3   Age                  5 non-null      int64
 4   Salary               5 non-null      int64
 5   Years_of_Experience  5 non-null      int64
 6   Joining_Date         5 non-null      object
 7   Gender               5 non-null      object
 8   Bonus                5 non-null      int64
 9   Rating               5 non-null      float64
dtypes: float64(1), int64(5), object(4)
memory usage: 532.0+ bytes
None

In [7]:
# c) Descriptive statistics
print("\nDescriptive Statistics:")
print(df.describe())

Descriptive Statistics:
       Employee_ID        Age       Salary  Years_of_Experience   Bonus  \
count     5.000000   5.000000      5.00000             5.000000     5.0
mean    103.000000  34.000000  60000.00000             7.400000  5500.0
std       1.581139   5.612486   7905.69415             3.847077  1000.0
min     101.000000  28.000000  50000.00000             3.000000  4500.0
25%     102.000000  29.000000  55000.00000             4.000000  5000.0
50%     103.000000  34.000000  60000.00000             8.000000  5000.0
75%     104.000000  38.000000  65000.00000            10.000000  6000.0
max     105.000000  41.000000  70000.00000            12.000000  7000.0

         Rating
count  5.000000
mean   4.100000
std    0.494975
min    3.500000
25%    3.800000
50%    4.000000
75%    4.500000
max    4.700000

In [8]:
# d) First 5 rows and last 3 rows
print("\nFirst 5 rows:")
print(df.head())
print("\nLast 3 rows:")
print(df.tail(3))

First 5 rows:
   Employee_ID     Name Department  Age  Salary  Years_of_Experience  \
0          101    Alice         HR   29   50000                    4
1          102      Bob         IT   34   70000                    8
2          103  Charlie         IT   41   65000                   10
3          104    Diana  Marketing   28   55000                    3
4          105   Edward      Sales   38   60000                   12

  Joining_Date  Gender  Bonus  Rating
0   2020-03-15  Female   5000     4.5
1   2017-07-19    Male   7000     4.0
2   2013-06-01    Male   6000     3.8
3   2021-02-10  Female   4500     4.7
4   2010-11-25    Male   5000     3.5

Last 3 rows:
   Employee_ID     Name Department  Age  Salary  Years_of_Experience  \
2          103  Charlie         IT   41   65000                   10
3          104    Diana  Marketing   28   55000                    3
4          105   Edward      Sales   38   60000                   12

  Joining_Date  Gender  Bonus  Rating
2   2013-06-01    Male   6000     3.8
3   2021-02-10  Female   4500     4.7
4   2010-11-25    Male   5000     3.5

In [9]:
# e) Calculations & statistics
print("\nAverage Salary:", df['Salary'].mean())
print("Total Bonus:", df['Bonus'].sum())
print("Youngest Age:", df['Age'].min())
print("Highest Performance Rating:", df['Rating'].max())

Average Salary: 60000.0
Total Bonus: 27500
Youngest Age: 28
Highest Performance Rating: 4.7

In [10]:
# f) Sort by salary descending
df_sorted = df.sort_values(by='Salary', ascending=False)
print("\nSorted by Salary (descending):")
print(df_sorted)

Sorted by Salary (descending):
   Employee_ID     Name Department  Age  Salary  Years_of_Experience  \
1          102      Bob         IT   34   70000                    8
2          103  Charlie         IT   41   65000                   10
4          105   Edward      Sales   38   60000                   12
3          104    Diana  Marketing   28   55000                    3
0          101    Alice         HR   29   50000                    4

  Joining_Date  Gender  Bonus  Rating
1   2017-07-19    Male   7000     4.0
2   2013-06-01    Male   6000     3.8
4   2010-11-25    Male   5000     3.5
3   2021-02-10  Female   4500     4.7
0   2020-03-15  Female   5000     4.5

In [11]:
# g) New column: Performance Category
def categorize_rating(r):
    if r >= 4.5:
        return "Excellent"
    elif r >= 4.0:
        return "Good"
    else:
        return "Average"
df['Performance_Category'] = df['Rating'].apply(categorize_rating)
print("\nWith Performance Category:")
print(df[['Name', 'Rating', 'Performance_Category']])

With Performance Category:
      Name  Rating Performance_Category
0    Alice     4.5            Excellent
1      Bob     4.0                 Good
2  Charlie     3.8              Average
3    Diana     4.7            Excellent
4   Edward     3.5              Average

In [12]:
# h) Identify missing values
print("\nMissing values per column:")
print(df.isnull().sum())

Missing values per column:
Employee_ID             0
Name                    0
Department              0
Age                     0
Salary                  0
Years_of_Experience     0
Joining_Date            0
Gender                  0
Bonus                   0
Rating                  0
Performance_Category    0
dtype: int64

In [13]:
# i) Rename Employee_ID to ID
df.rename(columns={'Employee_ID': 'ID'}, inplace=True)

In [14]:
# j) Filter employees
over_5_years = df[df['Years_of_Experience'] > 5]
print("\nEmployees with >5 years experience:")
print(over_5_years)
it_department = df[df['Department'] == 'IT']
print("\nEmployees in IT Department:")
print(it_department)

Employees with >5 years experience:
    ID     Name Department  Age  Salary  Years_of_Experience Joining_Date  \
1  102      Bob         IT   34   70000                    8   2017-07-19
2  103  Charlie         IT   41   65000                   10   2013-06-01
4  105   Edward      Sales   38   60000                   12   2010-11-25

  Gender  Bonus  Rating Performance_Category
1   Male   7000     4.0                 Good
2   Male   6000     3.8              Average
4   Male   5000     3.5              Average

Employees in IT Department:
    ID     Name Department  Age  Salary  Years_of_Experience Joining_Date  \
1  102      Bob         IT   34   70000                    8   2017-07-19
2  103  Charlie         IT   41   65000                   10   2013-06-01

  Gender  Bonus  Rating Performance_Category
1   Male   7000     4.0                 Good
2   Male   6000     3.8              Average

In [15]:
# k) Add Tax column: 10% of Salary
df['Tax'] = df['Salary']*0.1

In [16]:
# l) Save to new CSV file
df.to_csv('employees_modified.csv', index=False)